tiborsimon/embedded-tdd-headers/pic/pic18/pic18f65j94_tdd.h
/* Generated on 2016-07-26
===============================================================================
      P I C   T D D   R E A D Y   R E G I S T E R   D E F I N I T I O N
===============================================================================

Created by Tibor Simon - tiborsimon.io
Generator script:  https://github.com/tiborsimon/pic-definition-converter

Based on the register definition header file v1.37 provided by Microchip.
Original definition date and license: */

// Generated 11/03/2016 GMT

/*
* Copyright © 2016, Microchip Technology Inc. and its subsidiaries ("Microchip")
* All rights reserved.
*
* This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
*
* Redistribution and use in source and binary forms, with or without modification, are
* permitted provided that the following conditions are met:
*
*     1. Redistributions of source code must retain the above copyright notice, this list of
*        conditions and the following disclaimer.
*
*     2. Redistributions in binary form must reproduce the above copyright notice, this list
*        of conditions and the following disclaimer in the documentation and/or other
*        materials provided with the distribution.
*
*     3. Microchip's name may not be used to endorse or promote products derived from this
*        software without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
* INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
* PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
* PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
* LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
* THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*  */

#ifndef _PIC18F65J94_H_
#define _PIC18F65J94_H_

#define UEP0                          0
#define UEP0_EPSTALL                  1
#define EP0STALL                      2
#define EPSTALL0                      3
#define UEP0_EPINEN                   4
#define EPINEN0                       5
#define EP0INEN                       6
#define UEP0_EPOUTEN                  7
#define EP0OUTEN                      8
#define EPOUTEN0                      9
#define EPCONDIS0                     10
#define EP0CONDIS                     11
#define UEP0_EPCONDIS                 12
#define UEP0_EPHSHK                   13
#define EP0HSHK                       14
#define EPHSHK0                       15
#define UEP1                          16
#define EPSTALL1                      17
#define EP1STALL                      18
#define UEP1_EPSTALL                  19
#define EPINEN1                       20
#define EP1INEN                       21
#define UEP1_EPINEN                   22
#define EPOUTEN1                      23
#define UEP1_EPOUTEN                  24
#define EP1OUTEN                      25
#define UEP1_EPCONDIS                 26
#define EP1CONDIS                     27
#define EPCONDIS1                     28
#define EPHSHK1                       29
#define EP1HSHK                       30
#define UEP1_EPHSHK                   31
#define UEP2                          32
#define EP2STALL                      33
#define EPSTALL2                      34
#define UEP2_EPSTALL                  35
#define EP2INEN                       36
#define EPINEN2                       37
#define UEP2_EPINEN                   38
#define EP2OUTEN                      39
#define UEP2_EPOUTEN                  40
#define EPOUTEN2                      41
#define EP2CONDIS                     42
#define UEP2_EPCONDIS                 43
#define EPCONDIS2                     44
#define EP2HSHK                       45
#define EPHSHK2                       46
#define UEP2_EPHSHK                   47
#define UEP3                          48
#define UEP3_EPSTALL                  49
#define EPSTALL3                      50
#define EP3STALL                      51
#define UEP3_EPINEN                   52
#define EPINEN3                       53
#define EP3INEN                       54
#define EP3OUTEN                      55
#define EPOUTEN3                      56
#define UEP3_EPOUTEN                  57
#define UEP3_EPCONDIS                 58
#define EP3CONDIS                     59
#define EPCONDIS3                     60
#define EPHSHK3                       61
#define UEP3_EPHSHK                   62
#define EP3HSHK                       63
#define UEP4                          64
#define EP4STALL                      65
#define EPSTALL4                      66
#define UEP4_EPSTALL                  67
#define UEP4_EPINEN                   68
#define EP4INEN                       69
#define EPINEN4                       70
#define UEP4_EPOUTEN                  71
#define EPOUTEN4                      72
#define EP4OUTEN                      73
#define EPCONDIS4                     74
#define EP4CONDIS                     75
#define UEP4_EPCONDIS                 76
#define EPHSHK4                       77
#define EP4HSHK                       78
#define UEP4_EPHSHK                   79
#define UEP5                          80
#define EP5STALL                      81
#define UEP5_EPSTALL                  82
#define EPSTALL5                      83
#define EPINEN5                       84
#define UEP5_EPINEN                   85
#define EP5INEN                       86
#define EPOUTEN5                      87
#define UEP5_EPOUTEN                  88
#define EP5OUTEN                      89
#define EPCONDIS5                     90
#define EP5CONDIS                     91
#define UEP5_EPCONDIS                 92
#define UEP5_EPHSHK                   93
#define EPHSHK5                       94
#define EP5HSHK                       95
#define UEP6                          96
#define EPSTALL6                      97
#define UEP6_EPSTALL                  98
#define EP6STALL                      99
#define EP6INEN                       100
#define UEP6_EPINEN                   101
#define EPINEN6                       102
#define EP6OUTEN                      103
#define EPOUTEN6                      104
#define UEP6_EPOUTEN                  105
#define UEP6_EPCONDIS                 106
#define EP6CONDIS                     107
#define EPCONDIS6                     108
#define EPHSHK6                       109
#define UEP6_EPHSHK                   110
#define EP6HSHK                       111
#define UEP7                          112
#define UEP7_EPSTALL                  113
#define EP7STALL                      114
#define EPSTALL7                      115
#define EP7INEN                       116
#define EPINEN7                       117
#define UEP7_EPINEN                   118
#define EP7OUTEN                      119
#define UEP7_EPOUTEN                  120
#define EPOUTEN7                      121
#define UEP7_EPCONDIS                 122
#define EP7CONDIS                     123
#define EPCONDIS7                     124
#define EPHSHK7                       125
#define UEP7_EPHSHK                   126
#define EP7HSHK                       127
#define UEP8                          128
#define EPSTALL8                      129
#define UEP8_EPSTALL                  130
#define UEP8_EPINEN                   131
#define EPINEN8                       132
#define UEP8_EPOUTEN                  133
#define EPOUTEN8                      134
#define UEP8_EPCONDIS                 135
#define EPCONDIS8                     136
#define UEP8_EPHSHK                   137
#define EPHSHK8                       138
#define UEP9                          139
#define EPSTALL9                      140
#define UEP9_EPSTALL                  141
#define EPINEN9                       142
#define UEP9_EPINEN                   143
#define UEP9_EPOUTEN                  144
#define EPOUTEN9                      145
#define UEP9_EPCONDIS                 146
#define EPCONDIS9                     147
#define UEP9_EPHSHK                   148
#define EPHSHK9                       149
#define UEP10                         150
#define EPSTALL10                     151
#define UEP10_EPSTALL                 152
#define EPINEN10                      153
#define UEP10_EPINEN                  154
#define UEP10_EPOUTEN                 155
#define EPOUTEN10                     156
#define EPCONDIS10                    157
#define UEP10_EPCONDIS                158
#define UEP10_EPHSHK                  159
#define EPHSHK10                      160
#define UEP11                         161
#define UEP11_EPSTALL                 162
#define EPSTALL11                     163
#define EPINEN11                      164
#define UEP11_EPINEN                  165
#define UEP11_EPOUTEN                 166
#define EPOUTEN11                     167
#define EPCONDIS11                    168
#define UEP11_EPCONDIS                169
#define UEP11_EPHSHK                  170
#define EPHSHK11                      171
#define UEP12                         172
#define EPSTALL12                     173
#define UEP12_EPSTALL                 174
#define UEP12_EPINEN                  175
#define EPINEN12                      176
#define EPOUTEN12                     177
#define UEP12_EPOUTEN                 178
#define EPCONDIS12                    179
#define UEP12_EPCONDIS                180
#define EPHSHK12                      181
#define UEP12_EPHSHK                  182
#define UEP13                         183
#define UEP13_EPSTALL                 184
#define EPSTALL13                     185
#define EPINEN13                      186
#define UEP13_EPINEN                  187
#define UEP13_EPOUTEN                 188
#define EPOUTEN13                     189
#define EPCONDIS13                    190
#define UEP13_EPCONDIS                191
#define EPHSHK13                      192
#define UEP13_EPHSHK                  193
#define UEP14                         194
#define UEP14_EPSTALL                 195
#define EPSTALL14                     196
#define EPINEN14                      197
#define UEP14_EPINEN                  198
#define UEP14_EPOUTEN                 199
#define EPOUTEN14                     200
#define EPCONDIS14                    201
#define UEP14_EPCONDIS                202
#define UEP14_EPHSHK                  203
#define EPHSHK14                      204
#define UEP15                         205
#define UEP15_EPSTALL                 206
#define EPSTALL15                     207
#define UEP15_EPINEN                  208
#define EPINEN15                      209
#define UEP15_EPOUTEN                 210
#define EPOUTEN15                     211
#define EPCONDIS15                    212
#define UEP15_EPCONDIS                213
#define UEP15_EPHSHK                  214
#define EPHSHK15                      215
#define UEIE                          216
#define PIDEE                         217
#define CRC5EE                        218
#define CRC16EE                       219
#define DFN8EE                        220
#define BTOEE                         221
#define BTSEE                         222
#define UIE                           223
#define URSTIE                        224
#define UERRIE                        225
#define ACTVIE                        226
#define TRNIE                         227
#define IDLEIE                        228
#define STALLIE                       229
#define SOFIE                         230
#define UCFG                          231
#define UPP0                          232
#define PPB0                          233
#define UPP1                          234
#define PPB1                          235
#define FSEN                          236
#define UTRDIS                        237
#define UPUEN                         238
#define UOEMON                        239
#define UTEYE                         240
#define RPOR0_1                       241
#define RPO0R0                        242
#define RPO0R                         243
#define RPO0R1                        244
#define RPO0R2                        245
#define RPO0R3                        246
#define RPO1R                         247
#define RPO1R0                        248
#define RPO1R1                        249
#define RPO1R2                        250
#define RPO1R3                        251
#define RPOR2_3                       252
#define RPO2R0                        253
#define RPO2R                         254
#define RPO2R1                        255
#define RPO2R2                        256
#define RPO2R3                        257
#define RPO3R0                        258
#define RPO3R                         259
#define RPO3R1                        260
#define RPO3R2                        261
#define RPO3R3                        262
#define RPOR4_5                       263
#define RPO4R0                        264
#define RPO4R                         265
#define RPO4R1                        266
#define RPO4R2                        267
#define RPO4R3                        268
#define RPO5R0                        269
#define RPO5R                         270
#define RPO5R1                        271
#define RPO5R2                        272
#define RPO5R3                        273
#define RPOR6_7                       274
#define RPO6R0                        275
#define RPO6R                         276
#define RPO6R1                        277
#define RPO6R2                        278
#define RPO6R3                        279
#define RPO7R0                        280
#define RPO7R                         281
#define RPO7R1                        282
#define RPO7R2                        283
#define RPO7R3                        284
#define RPOR8_9                       285
#define RPO8R0                        286
#define RPO8R                         287
#define RPO8R1                        288
#define RPO8R2                        289
#define RPO8R3                        290
#define RPO9R                         291
#define RPO9R0                        292
#define RPO9R1                        293
#define RPO9R2                        294
#define RPO9R3                        295
#define RPOR10_11                     296
#define RPO10R0                       297
#define RPO10R                        298
#define RPO10R1                       299
#define RPO10R2                       300
#define RPO10R3                       301
#define RPO11R0                       302
#define RPO11R                        303
#define RPO11R1                       304
#define RPO11R2                       305
#define RPO11R3                       306
#define RPOR12_13                     307
#define RPO12R0                       308
#define RPO12R                        309
#define RPO12R1                       310
#define RPO12R2                       311
#define RPO12R3                       312
#define RPO13R0                       313
#define RPO13R                        314
#define RPO13R1                       315
#define RPO13R2                       316
#define RPO13R3                       317
#define RPOR14_15                     318
#define RPO14R                        319
#define RPO14R0                       320
#define RPO14R1                       321
#define RPO14R2                       322
#define RPO14R3                       323
#define RPO15R                        324
#define RPO15R0                       325
#define RPO15R1                       326
#define RPO15R2                       327
#define RPO15R3                       328
#define RPOR16_17                     329
#define RPO16R0                       330
#define RPO16R                        331
#define RPO16R1                       332
#define RPO16R2                       333
#define RPO16R3                       334
#define RPO17R0                       335
#define RPO17R                        336
#define RPO17R1                       337
#define RPO17R2                       338
#define RPO17R3                       339
#define RPOR18_19                     340
#define RPO18R                        341
#define RPO18R0                       342
#define RPO18R1                       343
#define RPO18R2                       344
#define RPO18R3                       345
#define RPO19R0                       346
#define RPO19R                        347
#define RPO19R1                       348
#define RPO19R2                       349
#define RPO19R3                       350
#define RPOR20_21                     351
#define RPO20R                        352
#define RPO20R0                       353
#define RPO20R1                       354
#define RPO20R2                       355
#define RPO20R3                       356
#define RPO21R                        357
#define RPO21R0                       358
#define RPO21R1                       359
#define RPO21R2                       360
#define RPO21R3                       361
#define RPOR22_23                     362
#define RPO22R                        363
#define RPO22R0                       364
#define RPO22R1                       365
#define RPO22R2                       366
#define RPO22R3                       367
#define RPO23R                        368
#define RPO23R0                       369
#define RPO23R1                       370
#define RPO23R2                       371
#define RPO23R3                       372
#define RPOR24_25                     373
#define RPO24R                        374
#define RPO24R0                       375
#define RPO24R1                       376
#define RPO24R2                       377
#define RPO24R3                       378
#define RPO25R0                       379
#define RPO25R                        380
#define RPO25R1                       381
#define RPO25R2                       382
#define RPO25R3                       383
#define RPOR26_27                     384
#define RPO26R                        385
#define RPO26R0                       386
#define RPO26R1                       387
#define RPO26R2                       388
#define RPO26R3                       389
#define RPO27R                        390
#define RPO27R0                       391
#define RPO27R1                       392
#define RPO27R2                       393
#define RPO27R3                       394
#define RPOR28_29                     395
#define RPO28R                        396
#define RPO28R0                       397
#define RPO28R1                       398
#define RPO28R2                       399
#define RPO28R3                       400
#define RPO29R0                       401
#define RPO29R                        402
#define RPO29R1                       403
#define RPO29R2                       404
#define RPO29R3                       405
#define RPOR30_31                     406
#define RPO30R                        407
#define RPO30R0                       408
#define RPO30R1                       409
#define RPO30R2                       410
#define RPO30R3                       411
#define RPO31R                        412
#define RPO31R0                       413
#define RPO31R1                       414
#define RPO31R2                       415
#define RPO31R3                       416
#define RPOR32_33                     417
#define RPO32R0                       418
#define RPO32R                        419
#define RPO32R1                       420
#define RPO32R2                       421
#define RPO32R3                       422
#define RPO33R                        423
#define RPO33R0                       424
#define RPO33R1                       425
#define RPO33R2                       426
#define RPO33R3                       427
#define RPOR34_35                     428
#define RPO34R0                       429
#define RPO34R                        430
#define RPO34R1                       431
#define RPO34R2                       432
#define RPO34R3                       433
#define RPO35R0                       434
#define RPO35R                        435
#define RPO35R1                       436
#define RPO35R2                       437
#define RPO35R3                       438
#define RPOR36_37                     439
#define RPO36R0                       440
#define RPO36R                        441
#define RPO36R1                       442
#define RPO36R2                       443
#define RPO36R3                       444
#define RPO37R                        445
#define RPO37R0                       446
#define RPO37R1                       447
#define RPO37R2                       448
#define RPO37R3                       449
#define RPOR38_39                     450
#define RPO38R                        451
#define RPO38R0                       452
#define RPO38R1                       453
#define RPO38R2                       454
#define RPO38R3                       455
#define RPO39R                        456
#define RPO39R0                       457
#define RPO39R1                       458
#define RPO39R2                       459
#define RPO39R3                       460
#define RPOR40_41                     461
#define RPO40R                        462
#define RPO40R0                       463
#define RPO40R1                       464
#define RPO40R2                       465
#define RPO40R3                       466
#define RPO41R                        467
#define RPO41R0                       468
#define RPO41R1                       469
#define RPO41R2                       470
#define RPO41R3                       471
#define RPOR42_43                     472
#define RPO42R                        473
#define RPO42R0                       474
#define RPO42R1                       475
#define RPO42R2                       476
#define RPO42R3                       477
#define RPO43R0                       478
#define RPO43R                        479
#define RPO43R1                       480
#define RPO43R2                       481
#define RPO43R3                       482
#define RPOR44_45                     483
#define RPO44R                        484
#define RPO44R0                       485
#define RPO44R1                       486
#define RPO44R2                       487
#define RPO44R3                       488
#define RPO45R                        489
#define RPO45R0                       490
#define RPO45R1                       491
#define RPO45R2                       492
#define RPO45R3                       493
#define RPOR46                        494
#define RPO46R                        495
#define RPO46R0                       496
#define RPO46R1                       497
#define RPO46R2                       498
#define RPO46R3                       499
#define RPINR0_1                      500
#define U1RXR                         501
#define U1RXR0                        502
#define U1RXR1                        503
#define U1RXR2                        504
#define U1RXR3                        505
#define U1TXR0                        506
#define U1TXR                         507
#define U1TXR1                        508
#define U1TXR2                        509
#define U1TXR3                        510
#define RPINR2_3                      511
#define U2RXR                         512
#define U2RXR0                        513
#define U2RXR1                        514
#define U2RXR2                        515
#define U2RXR3                        516
#define U2TXR0                        517
#define U2TXR                         518
#define U2TXR1                        519
#define U2TXR2                        520
#define U2TXR3                        521
