tiborsimon/embedded-tdd-headers/pic/pic18/pic18f65j94_tdd.h
#define S08C0                         1091
#define S09C0                         1092
#define S10C0                         1093
#define S11C0                         1094
#define S12C0                         1095
#define S13C0                         1096
#define S14C0                         1097
#define S15C0                         1098
#define LCDDATA2                      1099
#define S16C0                         1100
#define S17C0                         1101
#define S18C0                         1102
#define S19C0                         1103
#define S20C0                         1104
#define S21C0                         1105
#define S22C0                         1106
#define S23C0                         1107
#define LCDDATA3                      1108
#define S24C0                         1109
#define S25C0                         1110
#define S26C0                         1111
#define S27C0                         1112
#define S28C0                         1113
#define S29C0                         1114
#define S30C0                         1115
#define S31C0                         1116
#define LCDDATA4                      1117
#define S32C0                         1118
#define S33C0                         1119
#define S34C0                         1120
#define S35C0                         1121
#define S36C0                         1122
#define S37C0                         1123
#define S38C0                         1124
#define S39C0                         1125
#define LCDDATA5                      1126
#define S40C0                         1127
#define S40C15                        1128
#define S41C0                         1129
#define S42C0                         1130
#define S43C0                         1131
#define S44C0                         1132
#define S45C0                         1133
#define S46C0                         1134
#define S47C0                         1135
#define LCDDATA6                      1136
#define S48C0                         1137
#define S49C0                         1138
#define S50C0                         1139
#define S51C0                         1140
#define S52C0                         1141
#define S53C0                         1142
#define S54C0                         1143
#define S55C0                         1144
#define LCDDATA7                      1145
#define S56C0                         1146
#define S57C0                         1147
#define S58C0                         1148
#define S59C0                         1149
#define S60C0                         1150
#define S61C0                         1151
#define S62C0                         1152
#define S63C0                         1153
#define LCDDATA8                      1154
#define S00C1                         1155
#define S01C1                         1156
#define S02C1                         1157
#define S03C1                         1158
#define S04C1                         1159
#define S05C1                         1160
#define S06C1                         1161
#define S07C1                         1162
#define LCDDATA9                      1163
#define S08C1                         1164
#define S09C1                         1165
#define S10C1                         1166
#define S11C1                         1167
#define S12C1                         1168
#define S13C1                         1169
#define S14C1                         1170
#define S15C1                         1171
#define LCDDATA10                     1172
#define S16C1                         1173
#define S17C1                         1174
#define S18C1                         1175
#define S19C1                         1176
#define S20C1                         1177
#define S21C1                         1178
#define S22C1                         1179
#define S23C1                         1180
#define LCDDATA11                     1181
#define S24C1                         1182
#define LCDDATA11_ADMSK1              1183
#define S25C1                         1184
#define LCDDATA11_ADMSK2              1185
#define S26C1                         1186
#define LCDDATA11_ADMSK3              1187
#define S27C1                         1188
#define LCDDATA11_ADMSK4              1189
#define S28C1                         1190
#define LCDDATA11_ADMSK5              1191
#define S29C1                         1192
#define S30C1                         1193
#define S31C1                         1194
#define LCDDATA12                     1195
#define S32C1                         1196
#define SSPM012                       1197
#define SSPM112                       1198
#define S33C1                         1199
#define S34C1                         1200
#define SSPM212                       1201
#define SSPM312                       1202
#define S35C1                         1203
#define S36C1                         1204
#define S37C1                         1205
#define S38C1                         1206
#define S39C1                         1207
#define LCDDATA13                     1208
#define S40C1                         1209
#define S41C1                         1210
#define S42C1                         1211
#define S43C1                         1212
#define S44C1                         1213
#define S45C1                         1214
#define S46C1                         1215
#define S47C1                         1216
#define LCDDATA14                     1217
#define LCDDATA14_MSK0                1218
#define S48C1                         1219
#define LCDDATA14_MSK1                1220
#define S49C1                         1221
#define S50C1                         1222
#define LCDDATA14_MSK2                1223
#define S51C1                         1224
#define LCDDATA14_MSK3                1225
#define LCDDATA14_MSK4                1226
#define S52C1                         1227
#define LCDDATA14_MSK5                1228
#define S53C1                         1229
#define LCDDATA14_MSK6                1230
#define S54C1                         1231
#define LCDDATA14_MSK7                1232
#define S55C1                         1233
#define LCDDATA15                     1234
#define S56C1                         1235
#define S57C1                         1236
#define S58C1                         1237
#define S59C1                         1238
#define S60C1                         1239
#define S61C1                         1240
#define S62C1                         1241
#define S63C1                         1242
#define LCDDATA16                     1243
#define T4CKPS016                     1244
#define S00C2                         1245
#define S01C2                         1246
#define T4CKPS116                     1247
#define S02C2                         1248
#define T4OUTPS016                    1249
#define S03C2                         1250
#define T4OUTPS116                    1251
#define S04C2                         1252
#define S05C2                         1253
#define T4OUTPS216                    1254
#define T4OUTPS316                    1255
#define S06C2                         1256
#define S07C2                         1257
#define LCDDATA17                     1258
#define S08C2                         1259
#define S09C2                         1260
#define S10C2                         1261
#define S11C2                         1262
#define S12C2                         1263
#define S13C2                         1264
#define S14C2                         1265
#define S15C2                         1266
#define LCDDATA18                     1267
#define S16C2                         1268
#define S17C2                         1269
#define S18C2                         1270
#define S19C2                         1271
#define S20C2                         1272
#define S21C2                         1273
#define S22C2                         1274
#define S23C2                         1275
#define LCDDATA19                     1276
#define S24C2                         1277
#define S25C2                         1278
#define S26C2                         1279
#define S27C2                         1280
#define T3CKPS019                     1281
#define S28C2                         1282
#define T3CKPS119                     1283
#define S29C2                         1284
#define TMR3CS019                     1285
#define S30C2                         1286
#define TMR3CS119                     1287
#define S31C2                         1288
#define LCDDATA20                     1289
#define S32C2                         1290
#define S33C2                         1291
#define S34C2                         1292
#define S35C2                         1293
#define S36C2                         1294
#define S37C2                         1295
#define S38C2                         1296
#define S39C2                         1297
#define LCDDATA21                     1298
#define S40C2                         1299
#define S41C2                         1300
#define S42C2                         1301
#define S43C2                         1302
#define S44C2                         1303
#define S45C2                         1304
#define S46C2                         1305
#define S47C2                         1306
#define LCDDATA22                     1307
#define S48C2                         1308
#define S49C2                         1309
#define S50C2                         1310
#define S51C2                         1311
#define S52C2                         1312
#define S53C2                         1313
#define S54C2                         1314
#define S55C2                         1315
#define LCDDATA23                     1316
#define S56C2                         1317
#define S57C2                         1318
#define S58C2                         1319
#define S59C2                         1320
#define S60C2                         1321
#define S61C2                         1322
#define S62C2                         1323
#define S63C2                         1324
#define LCDDATA24                     1325
#define S00C3                         1326
#define S01C3                         1327
#define S02C3                         1328
#define S03C3                         1329
#define S04C3                         1330
#define S05C3                         1331
#define S06C3                         1332
#define S07C3                         1333
#define LCDDATA25                     1334
#define S08C3                         1335
#define S09C3                         1336
#define S10C3                         1337
#define S11C3                         1338
#define S12C3                         1339
#define S13C3                         1340
#define S14C3                         1341
#define S15C3                         1342
#define LCDDATA26                     1343
#define S16C3                         1344
#define S17C3                         1345
#define S18C3                         1346
#define S19C3                         1347
#define S20C3                         1348
#define S21C3                         1349
#define S22C3                         1350
#define S23C3                         1351
#define LCDDATA27                     1352
#define S24C3                         1353
#define S25C3                         1354
#define S26C3                         1355
#define S27C3                         1356
#define S28C3                         1357
#define S29C3                         1358
#define S30C3                         1359
#define S31C3                         1360
#define LCDDATA28                     1361
#define S32C3                         1362
#define S33C3                         1363
#define S34C3                         1364
#define S35C3                         1365
#define S36C3                         1366
#define S37C3                         1367
#define S38C3                         1368
#define S39C3                         1369
#define LCDDATA29                     1370
#define S40C3                         1371
#define S41C3                         1372
#define S42C3                         1373
#define S43C3                         1374
#define S44C3                         1375
#define S45C3                         1376
#define S46C3                         1377
#define S47C3                         1378
#define LCDDATA30                     1379
#define S48C3                         1380
#define S49C3                         1381
#define S50C3                         1382
#define S51C3                         1383
#define S52C3                         1384
#define S53C3                         1385
#define S54C3                         1386
#define S55C3                         1387
#define LCDDATA31                     1388
#define S56C3                         1389
#define S57C3                         1390
#define S58C3                         1391
#define S59C3                         1392
#define S60C3                         1393
#define S61C3                         1394
#define S62C3                         1395
#define S63C3                         1396
#define LCDDATA32                     1397
#define S00C4                         1398
#define S01C4                         1399
#define S02C4                         1400
#define S03C4                         1401
#define S04C4                         1402
#define S05C4                         1403
#define S06C4                         1404
#define S07C4                         1405
#define LCDDATA33                     1406
#define S08C4                         1407
#define S09C4                         1408
#define S10C4                         1409
#define S11C4                         1410
#define S12C4                         1411
#define S13C4                         1412
#define S14C4                         1413
#define S15C4                         1414
#define LCDDATA34                     1415
#define S16C4                         1416
#define S17C4                         1417
#define S18C4                         1418
#define S19C4                         1419
#define S20C4                         1420
#define S21C4                         1421
#define S22C4                         1422
#define S23C4                         1423
#define LCDDATA35                     1424
#define S24C4                         1425
#define S25C4                         1426
#define S26C4                         1427
#define S27C4                         1428
#define S28C4                         1429
#define S29C4                         1430
#define S30C4                         1431
#define S31C4                         1432
#define LCDDATA36                     1433
#define S32C4                         1434
#define S33C4                         1435
#define S34C4                         1436
#define S35C4                         1437
#define S36C4                         1438
#define S37C4                         1439
#define S38C4                         1440
#define S39C4                         1441
#define LCDDATA37                     1442
#define S40C4                         1443
#define S41C4                         1444
#define S42C4                         1445
#define S43C4                         1446
#define S44C4                         1447
#define S45C4                         1448
#define S46C4                         1449
#define S47C4                         1450
#define LCDDATA38                     1451
#define S48C4                         1452
#define S49C4                         1453
#define S50C4                         1454
#define S51C4                         1455
#define S52C4                         1456
#define S53C4                         1457
#define S54C4                         1458
#define S55C4                         1459
#define LCDDATA39                     1460
#define S56C4                         1461
#define S57C4                         1462
#define S58C4                         1463
#define S59C4                         1464
#define S60C4                         1465
#define S61C4                         1466
#define S62C4                         1467
#define S63C4                         1468
#define LCDDATA40                     1469
#define S00C5                         1470
#define S01C5                         1471
#define S02C5                         1472
#define S03C5                         1473
#define S04C5                         1474
#define S05C5                         1475
#define S06C5                         1476
#define S07C5                         1477
#define LCDDATA41                     1478
#define S08C5                         1479
#define S09C5                         1480
#define S10C5                         1481
#define S11C5                         1482
#define S12C5                         1483
#define S13C5                         1484
#define S14C5                         1485
#define S15C5                         1486
#define LCDDATA42                     1487
#define S16C5                         1488
#define S17C5                         1489
#define S18C5                         1490
#define S19C5                         1491
#define S20C5                         1492
#define S21C5                         1493
#define S22C5                         1494
#define S23C5                         1495
#define LCDDATA43                     1496
#define S24C5                         1497
#define S25C5                         1498
#define S26C5                         1499
#define S27C5                         1500
#define S28C5                         1501
#define S29C5                         1502
#define S30C5                         1503
#define S31C5                         1504
#define LCDDATA44                     1505
#define S32C5                         1506
#define S33C5                         1507
#define S34C5                         1508
#define S35C5                         1509
#define S36C5                         1510
#define S37C5                         1511
#define S38C5                         1512
#define S39C5                         1513
#define LCDDATA45                     1514
#define S40C5                         1515
#define S41C5                         1516
#define S42C5                         1517
#define S43C5                         1518
#define S44C5                         1519
#define S45C5                         1520
#define S46C5                         1521
#define S47C5                         1522
#define LCDDATA46                     1523
#define S48C5                         1524
#define S49C5                         1525
#define S50C5                         1526
#define S51C5                         1527
#define S52C5                         1528
#define S53C5                         1529
#define S54C5                         1530
#define S55C5                         1531
#define LCDDATA47                     1532
#define S56C5                         1533
#define S57C5                         1534
#define S58C5                         1535
#define S59C5                         1536
#define S60C5                         1537
#define S61C5                         1538
#define S62C5                         1539
#define S63C5                         1540
#define LCDDATA48                     1541
#define S00C6                         1542
#define S01C6                         1543
#define S02C6                         1544
#define S03C6                         1545
#define S04C6                         1546
#define S05C6                         1547
#define S06C6                         1548
#define S07C6                         1549
#define LCDDATA49                     1550
#define S08C6                         1551
#define S09C6                         1552
#define S10C6                         1553
#define S11C6                         1554
#define S12C6                         1555
#define S13C6                         1556
#define S14C6                         1557
#define S15C6                         1558
#define LCDDATA50                     1559
#define S16C6                         1560
#define S17C6                         1561
#define S18C6                         1562
#define S19C6                         1563
#define S20C6                         1564
#define S21C6                         1565
#define S22C6                         1566
#define S23C6                         1567
#define LCDDATA51                     1568
#define S24C6                         1569
#define S25C6                         1570
#define S26C6                         1571
#define S27C6                         1572
#define S28C6                         1573
#define S29C6                         1574
#define S30C6                         1575
#define S31C6                         1576
#define LCDDATA52                     1577
#define S32C6                         1578
#define S33C6                         1579
#define S34C6                         1580
#define S35C6                         1581
#define S36C6                         1582
#define S37C6                         1583
#define S38C6                         1584
#define S39C6                         1585
#define LCDDATA53                     1586
#define S40C6                         1587
#define S41C6                         1588
#define S42C6                         1589
#define S43C6                         1590
#define S44C6                         1591
#define S45C6                         1592
#define S46C6                         1593
#define S47C6                         1594
#define LCDDATA54                     1595
#define S48C6                         1596
#define S49C6                         1597
#define S50C6                         1598
#define S51C6                         1599
#define S52C6                         1600
#define S53C6                         1601
#define S54C6                         1602
#define S55C6                         1603
#define LCDDATA55                     1604
#define S56C6                         1605
#define S57C6                         1606
#define S58C6                         1607
#define S59C6                         1608
#define S60C6                         1609
#define S61C6                         1610
#define S62C6                         1611
#define S63C6                         1612
#define LCDDATA56                     1613
#define S00C7                         1614
#define S01C7                         1615
#define S02C7                         1616
#define S03C7                         1617
#define S04C7                         1618
#define S05C7                         1619
#define S06C7                         1620
#define S07C7                         1621
#define LCDDATA57                     1622
#define S08C7                         1623
#define S09C7                         1624
#define S10C7                         1625
#define S11C7                         1626
#define S12C7                         1627
#define S13C7                         1628
#define S14C7                         1629
#define S15C7                         1630
#define LCDDATA58                     1631
#define S16C7                         1632
#define S17C7                         1633
#define S18C7                         1634
#define S19C7                         1635
#define S20C7                         1636
#define S21C7                         1637
#define S22C7                         1638
#define S23C7                         1639
#define LCDDATA59                     1640
#define S24C7                         1641
#define S25C7                         1642
#define S26C7                         1643
#define S27C7                         1644
#define S28C7                         1645
#define S29C7                         1646
#define S30C7                         1647
#define S31C7                         1648
